#Generated by Fabric Compiler ( version 2022.2-SP4.2 <build 132111> ) at Thu Jul 25 10:13:32 2024

add_design E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/Dual_AD/dual_ad/ipcore/pll_clk/pll_clk.idf
add_design "E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/Dual_AD/dual_ad/ipcore/pll_clk/pll_clk.v"
add_design "E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/Dual_AD/dual_ad/ipcore/pll_clk/pll_clk_tb.v"
add_design "E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/Dual_AD/dual_ad/ipcore/pll_clk/pll_clk_tmpl.v"
add_design "E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/Dual_AD/dual_ad/ipcore/pll_clk/pll_clk_tmpl.vhdl"
add_design "E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/Dual_AD/dual_ad/hs_dual_ad.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module pll_clk_tb
remove_design -verilog "E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/Dual_AD/dual_ad/ipcore/pll_clk/pll_clk_tb.v"
remove_design -verilog "E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/Dual_AD/dual_ad/ipcore/pll_clk/pll_clk_tmpl.v"
remove_design -vhdl "E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/Dual_AD/dual_ad/ipcore/pll_clk/pll_clk_tmpl.vhdl"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module hs_dual_ad
add_constraint "E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/Dual_AD/dual_ad/dual_ad.fdc"
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module hs_dual_ad
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module hs_dual_ad
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module hs_dual_ad
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module hs_dual_ad
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
pnr 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module hs_dual_ad
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
remove_design -verilog "E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/Dual_AD/dual_ad/hs_dual_ad.v"
add_design "E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/Dual_AD/dual_ad/dual_ad.v"
remove_design E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/Dual_AD/dual_ad/ipcore/pll_clk/pll_clk.idf
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module hs_dual_ad
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
remove_design -verilog "E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/Dual_AD/dual_ad/dual_ad.v"
add_design "E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/Dual_AD/dual_ad/dual_ad.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module dual_ad
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module dual_ad
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
remove_constraint  -logic -fdc "E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/Dual_AD/dual_ad/dual_ad.fdc"
add_constraint "E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/Dual_AD/dual_ad/dual_ad.fdc"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module dual_ad
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module dual_ad
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
remove_constraint "E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/Dual_AD/dual_ad/device_map/hs_dual_ad.pcf"
remove_constraint -force -logic -fdc "E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/Dual_AD/dual_ad/dual_ad.fdc"
add_constraint "E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/Dual_AD/dual_ad/dual_ad.fdc"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module dual_ad
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module dual_ad
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module dual_ad
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module dual_ad
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module dual_ad
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module dual_ad
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module dual_ad
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module dual_ad
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module dual_ad
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_constraint -force -logic -fdc "E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/Dual_AD/dual_ad/dual_ad.fdc"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module dual_ad
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_constraint "E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/Dual_AD/dual_ad/dual_ad.fdc"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module dual_ad
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module dual_ad
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module dual_ad
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module dual_ad
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module dual_ad
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
add_design E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/Dual_AD/dual_ad/ipcore/pll_clk/pll_clk.idf
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module dual_ad
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module dual_ad
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
