#Generated by Fabric Compiler ( version 2022.2-SP4.2 <build 132111> ) at Wed Jul 24 13:36:39 2024

add_design E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/ip_pll/ip_pll/ipcore/pll_clk/pll_clk.idf
add_design "E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/ip_pll/ip_pll/ip_pll.v"
add_simulation "E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/ip_pll/ip_pll/tb_ip_pll.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ip_pll
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
add_constraint "E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/ip_pll/ip_pll/ip_pll.fdc"
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ip_pll
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ip_pll
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
