#Generated by Fabric Compiler ( version 2022.2-SP4.2 <build 132111> ) at Tue Jul 23 10:26:06 2024

remove_design -verilog "E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/led/user/src/led.v"
add_design "E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/led/led_pango/led.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module led
add_constraint "E:/NEU/FPGA/Learn/Learn_DigitalLogic/4WithHardware/logos/led/led_pango/led_pango.fdc"
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
